Revit 2024 API
BuiltInFailures.DesignOptionFailures.BadReferenceBetweenOptionsWarn Property
 An element may not reference an element in another Option of the same Option Set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BadReferenceBetweenOptionsWarn { get; }
Visual Basic
Public Shared ReadOnly Property BadReferenceBetweenOptionsWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BadReferenceBetweenOptionsWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace